Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпорту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпортуТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПеремещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннихЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПЛ_СозданНаОснованииПотребностиELMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>MRS_ДатаПервогоПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>IT_ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НачалоОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПЛ_Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПЛ_ПринятоELMA</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПЛ_UidПотребностиELMA</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПЛ_КоличествоПринятоELMA</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/MRS_HTTPИнтеграция/Ext/Module.bsl
#Область ШаблоныИнтеграции

// Шаблон-обработчик: создаёт ЗаказыНаПеремещение и ЗаказПоставщику из данных ELMA.
// Вызывается кодом шаблона типа «Обработчик» в справочнике ОДМ_МетодыИнтеграции
//
// Параметры:
//   Параметры - Структура - ОписаниеЗадачи обмена. Данные читаются из
//               Параметры.Параметры.Данные (массив; тип документа определяется
//               по ТипЗнч(Элемент["Ссылка"])). Результат записывается в Параметры.Результат.
//
// При ошибке валидации или проведения вызывает исключение (транзакция откатывается).
Процедура Шаблон_СоздатьДокументыЗаказНаПеремещениеЗаказПоставщику(Параметры) Экспорт

	МассивВходных = Параметры.Параметры.Данные;

	// --- Разбор по типу документа ---

	ЗаказыНаПеремещение    = Новый Массив;
	ДанныеЗаказаПоставщику = Неопределено;

	Для Каждого ЭлементДанных Из МассивВходных Цикл

		ТипСсылки = ТипЗнч(ЭлементДанных["Ссылка"]);

		Если ТипСсылки = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			ЗаказыНаПеремещение.Добавить(ЭлементДанных);
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ДанныеЗаказаПоставщику = ЭлементДанных;
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru='Неизвестный тип документа в массиве Данные: %1'"), ТипСсылки);
		КонецЕсли;

	КонецЦикла;

	// --- Проверка состава массива ---

	ОшибкиВалидации = Новый Массив;

	Если ЗаказыНаПеремещение.Количество() = 0 Тогда
		ОшибкиВалидации.Добавить(НСтр("ru='В Данные не передан ни один ЗаказНаПеремещение'"));
	КонецЕсли;

	Если ДанныеЗаказаПоставщику = Неопределено Тогда
		ОшибкиВалидации.Добавить(НСтр("ru='В Данные не передан ЗаказПоставщику'"));
	КонецЕсли;

	Если ОшибкиВалидации.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(ОшибкиВалидации, Символы.ПС);
	КонецЕсли;

	// --- Валидация обязательных полей, сбор ссылок для проверки существования ---

	СсылкиДляПроверки = Новый Массив;
	МножествоУИД      = Новый Соответствие;

	Для Каждого ДанныеЗНП Из ЗаказыНаПеремещение Цикл

		УИДПотребности = ДанныеЗНП["УИДПотребности"];
		Описание       = СтрШаблон("ЗаказНаПеремещение (УИД %1)", УИДПотребности);

		Если НЕ ЗначениеЗаполнено(УИДПотребности) Тогда
			ОшибкиВалидации.Добавить(НСтр("ru='ЗаказНаПеремещение: не заполнен УИДПотребности'"));
		Иначе
			МножествоУИД.Вставить(УИДПотребности, Истина);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ДанныеЗНП["Дата"]) Тогда
			ОшибкиВалидации.Добавить(СтрШаблон(НСтр("ru='%1: не заполнена Дата'"), Описание));
		КонецЕсли;

		Для Каждого ИмяПоля Из СтрРазделить("ОрганизацияИНН,ОрганизацияКПП,СкладОтправитель,СкладПолучатель", ",") Цикл

			ЗначениеПоля = ДанныеЗНП[ИмяПоля];

			Если НЕ ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ОшибкиВалидации.Добавить(СтрШаблон(НСтр("ru='%1: не заполнено поле %2'"), Описание, ИмяПоля));
			Иначе
				ЭлементПроверки = Новый Структура("Ссылка, ОписаниеПоля",
					ЗначениеПоля, СтрШаблон("%1.%2", Описание, ИмяПоля));
				СсылкиДляПроверки.Добавить(ЭлементПроверки);
			КонецЕсли;

		КонецЦикла;

		ТоварыЗНП = ДанныеЗНП["Товары"];

		Если ТоварыЗНП = Неопределено ИЛИ ТоварыЗНП.Количество() = 0 Тогда
			ОшибкиВалидации.Добавить(СтрШаблон(НСтр("ru='%1: не заполнена ТЧ Товары'"), Описание));
		Иначе

			Для Каждого СтрокаТоваров Из ТоварыЗНП Цикл

				Номенклатура = СтрокаТоваров["Номенклатура"];

				Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
					ОшибкиВалидации.Добавить(СтрШаблон(НСтр("ru='%1.Товары: не заполнена Номенклатура'"), Описание));
				Иначе
					ЭлементПроверки = Новый Структура("Ссылка, ОписаниеПоля",
						Номенклатура, СтрШаблон("%1.Товары.Номенклатура", Описание));
					СсылкиДляПроверки.Добавить(ЭлементПроверки);
				КонецЕсли;

				Если НЕ ЗначениеЗаполнено(СтрокаТоваров["Количество"]) Тогда
					ОшибкиВалидации.Добавить(СтрШаблон(НСтр("ru='%1.Товары: не заполнено Количество'"), Описание));
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	ШаблонЗаказы_ВалидироватьПоляЗаказаПоставщику(ДанныеЗаказаПоставщику, МножествоУИД, СсылкиДляПроверки, ОшибкиВалидации);

	Если ОшибкиВалидации.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(ОшибкиВалидации, Символы.ПС);
	КонецЕсли;

	// --- Проверка существования ссылок в базе данных ---

	ОшибкиСуществования = ШаблонЗаказы_ПроверитьСуществованиеСсылок(СсылкиДляПроверки);

	Если ОшибкиСуществования.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(ОшибкиСуществования, Символы.ПС);
	КонецЕсли;
		
	// --- Создание документов в транзакции ---

	СоответствиеУИДСсылка = Новый Соответствие;

	НачатьТранзакцию();
	Попытка

		Для Каждого ДанныеЗНП Из ЗаказыНаПеремещение Цикл

			ЗНП = Документы.ЗаказНаПеремещение.СоздатьДокумент();
			ШаблонЗаказы_ЗаполнитьЗаказНаПеремещение(ДанныеЗНП, ЗНП);
			ЗНП.Записать(РежимЗаписиДокумента.Проведение);

			СоответствиеУИДСсылка.Вставить(ДанныеЗНП["УИДПотребности"], ЗНП.Ссылка);

		КонецЦикла;

		ЗП = Документы.ЗаказПоставщику.СоздатьДокумент();
		ШаблонЗаказы_ЗаполнитьЗаказПоставщику(ДанныеЗаказаПоставщику, ЗП,
			ЗаказыНаПеремещение, СоответствиеУИДСсылка);
		ЗП.Записать(РежимЗаписиДокумента.Проведение);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// --- Формирование результата ---

	ЗаказыНаПеремещениеРезультат = Новый Массив;

	Для Каждого ДанныеЗНП Из ЗаказыНаПеремещение Цикл

		УИДПотребности = ДанныеЗНП["УИДПотребности"];
		ЗаказыНаПеремещениеРезультат.Добавить(Новый Структура(
			"УИДПотребности, УИДДокумента",
			УИДПотребности,
			Строка(СоответствиеУИДСсылка[УИДПотребности].УникальныйИдентификатор())));

	КонецЦикла;

	Параметры.Результат = Новый Структура(
		"ЗаказыНаПеремещение, УИДЗаказаПоставщику",
		ЗаказыНаПеремещениеРезультат,
		Строка(ЗП.Ссылка.УникальныйИдентификатор()));

КонецПроцедуры

// Проверяет обязательные поля ЗаказаПоставщику и собирает ссылочные поля
// для последующей проверки существования в базе данных.
//
// Параметры:
//   ДанныеЗП          - Структура    - данные из JSON.
//   МножествоУИД      - Соответствие - УИДПотребности ЗНП для проверки ИдентификаторСтроки.
//   СсылкиДляПроверки - Массив       - дополняется найденными ссылочными полями.
//   ОшибкиВалидации   - Массив       - дополняется найденными ошибками.
Процедура ШаблонЗаказы_ВалидироватьПоляЗаказаПоставщику(ДанныеЗП, МножествоУИД, СсылкиДляПроверки, ОшибкиВалидации)

	Если НЕ ЗначениеЗаполнено(ДанныеЗП["Дата"]) Тогда
		ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику: не заполнена Дата'"));
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДанныеЗП["Валюта"]) Тогда
		ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику: не заполнена Валюта'"));
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДанныеЗП["СуммаДокумента"]) Тогда
		ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику: не заполнена СуммаДокумента'"));
	КонецЕсли;

	Для Каждого ИмяПоля Из СтрРазделить("КонтрагентИНН,КонтрагентКПП,ОрганизацияИНН,ОрганизацияКПП,Склад,ДоговорДата,ДоговорНомер,IT_ВременнойСлот", ",") Цикл

		ЗначениеПоля = ДанныеЗП[ИмяПоля];

		Если НЕ ЗначениеЗаполнено(ЗначениеПоля) Тогда
			ОшибкиВалидации.Добавить(СтрШаблон(НСтр("ru='ЗаказПоставщику: не заполнено поле %1'"), ИмяПоля));
		Иначе
			ЭлементПроверки = Новый Структура("Ссылка, ОписаниеПоля",
				ЗначениеПоля, СтрШаблон("ЗаказПоставщику.%1", ИмяПоля));
			СсылкиДляПроверки.Добавить(ЭлементПроверки);
		КонецЕсли;

	КонецЦикла;

	ТоварыЗП = ДанныеЗП["Товары"];

	Если ТоварыЗП = Неопределено ИЛИ ТоварыЗП.Количество() = 0 Тогда
		ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику: не заполнена ТЧ Товары'"));
	Иначе

		Для Каждого СтрокаТоваров Из ТоварыЗП Цикл

			Если НЕ ЗначениеЗаполнено(СтрокаТоваров["Номенклатура"]) Тогда
				ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику.Товары: не заполнена Номенклатура'"));
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(СтрокаТоваров["Количество"]) Тогда
				ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику.Товары: не заполнено Количество'"));
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(СтрокаТоваров["Цена"]) Тогда
				ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику.Товары: не заполнена Цена'"));
			КонецЕсли;

			ИдСтроки = СтрокаТоваров["ИдентификаторСтроки"];

			Если НЕ ЗначениеЗаполнено(ИдСтроки) Тогда
				ОшибкиВалидации.Добавить(НСтр("ru='ЗаказПоставщику.Товары: не заполнен ИдентификаторСтроки'"));
			ИначеЕсли МножествоУИД.Получить(ИдСтроки) = Неопределено Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru='ЗаказПоставщику.Товары: ИдентификаторСтроки %1 не соответствует ни одному УИДПотребности ЗаказаНаПеремещение'"),
					ИдСтроки);
				ОшибкиВалидации.Добавить(ТекстОшибки);
			Иначе
				// ИдентификаторСтроки корректен — соответствует одному из ЗНП
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

// Заполняет реквизиты объекта ЗаказНаПеремещение из переданных данных интеграции.
// Заполняются только поля, предоставленные внешней системой; 1С-специфические
// реквизиты (ХозяйственнаяОперация, НалогообложениеНДС и т.д.) задаются отдельно.
//
// Параметры:
//   ДанныеЗНП - Структура  - данные из JSON (реквизиты уже десериализованы).
//   ЗНП        - ДокументОбъект.ЗаказНаПеремещение - заполняемый объект документа.
Процедура ШаблонЗаказы_ЗаполнитьЗаказНаПеремещение(ДанныеЗНП, ЗНП)

	ЗНП.Дата             = ДанныеЗНП["Дата"];
	ЗНП.СкладОтправитель = ДанныеЗНП["СкладОтправитель"];
	ЗНП.СкладПолучатель  = ДанныеЗНП["СкладПолучатель"];
	
	// Поиск реквизитов
	Организация = НайтиОрганизациюПоИННИКПП(ДанныеЗНП["ОрганизацияИНН"], ДанныеЗНП["ОрганизацияКПП"]);
	
	Если Организация = Неопределено Тогда
		Описание = СтрШаблон("Не найдена Организация по (ИНН: %1, КПП: %2)", ДанныеЗНП["ОрганизацияИНН"], ДанныеЗНП["ОрганизацияКПП"]);
		ВызватьИсключение Описание;
	Иначе 
		ЗНП.Организация = Организация;	
	КонецЕсли;
	
	// Реквизиты по-умолчанию
	ДатаПлюс7Дней 			= ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ДанныеЗНП["Дата"], 7, Перечисления.ЕдиницыИзмеренияВремени.День);
	ПользовательОбмена 		= Пользователи.ТекущийПользователь(); 
	
	Если ЗначениеЗаполнено(ДанныеЗНП["Комментарий"]) Тогда
		ЗНП.Комментарий = ДанныеЗНП["Комментарий"];
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗНП["ЖелаемаяДатаПоступления"]) Тогда
		ЗНП.ЖелаемаяДатаПоступления = ДанныеЗНП["ЖелаемаяДатаПоступления"];
	Иначе
		ЗНП.ЖелаемаяДатаПоступления = ДатаПлюс7Дней;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗНП["Ответственный"]) Тогда
		ЗНП.Ответственный = ДанныеЗНП["Ответственный"];
	Иначе
		ЗНП.Ответственный = ПользовательОбмена;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗНП["Автор"]) Тогда
		ЗНП.Автор = ДанныеЗНП["Автор"];
	Иначе
		ЗНП.Автор = ПользовательОбмена;
	КонецЕсли;

	// Реквизиты не из запроса, обязательные к заполнению, но по-умолчанию
	ЗНП.ВариантПриемкиТоваров 				= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ЗНП.ПеремещениеПодДеятельность 			= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ЗНП.Приоритет                           = Справочники.Приоритеты.ПолучитьНизшийПриоритет();
	ЗНП.ПЛ_СозданНаОснованииПотребностиELMA = Истина;                                               
	ЗНП.СпособДоставки                      = Перечисления.СпособыДоставки.Самовывоз;
	ЗНП.ХозяйственнаяОперация				= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	
	Для Каждого СтрокаТоваров Из ДанныеЗНП["Товары"] Цикл

		НоваяСтрока              		= ЗНП.Товары.Добавить();
		НоваяСтрока.Номенклатура 		= СтрокаТоваров["Номенклатура"];
		НоваяСтрока.Количество   		= СтрокаТоваров["Количество"];
		НоваяСтрока.КоличествоУпаковок  = СтрокаТоваров["Количество"];
		НоваяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.КОбеспечению;

		Если ЗначениеЗаполнено(СтрокаТоваров["ПЛ_Комментарий"]) Тогда
			НоваяСтрока.ПЛ_Комментарий 	= СтрокаТоваров["ПЛ_Комментарий"];
		КонецЕсли;
		
        ОбработатьСтрокуПриДобавленииЗНП(НоваяСтрока);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция НайтиОрганизациюПоИННИКПП(ИНН, КПП)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |	Организации.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.Организации КАК Организации
    |ГДЕ
    |	Организации.ИНН = &ИНН
    |	И Организации.КПП = &КПП";
    
    Запрос.УстановитьПараметр("ИНН", ИНН);
    Запрос.УстановитьПараметр("КПП", КПП);
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат Неопределено;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагентаПоИННИКПП(ИНН, КПП)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |	Контрагенты.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.Контрагенты КАК Контрагенты
    |ГДЕ
    |	Контрагенты.ИНН = &ИНН
    |	И Контрагенты.КПП = &КПП";
    
    Запрос.УстановитьПараметр("ИНН", ИНН);
    Запрос.УстановитьПараметр("КПП", КПП);
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат Неопределено;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиДоговор(Контрагент, ДоговорДата, ДоговорНомер)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |	ДоговорыКонтрагентов.Контрагент = &Контрагент
    |	И ДоговорыКонтрагентов.Дата = &ДоговорДата
    |	И ДоговорыКонтрагентов.Номер = &ДоговорНомер";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Запрос.УстановитьПараметр("ДоговорДата", ДоговорДата);
    Запрос.УстановитьПараметр("ДоговорНомер", ДоговорНомер);
	
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат Неопределено;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьСтрокуПриДобавленииЗНП(ТекущаяСтрока)
	
	Перем КэшированныеЗначения;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

// Заполняет реквизиты объекта ЗаказПоставщику из переданных данных интеграции
// и устанавливает связь с ЗаказамиНаПеремещение через ДокументОснование и ПЛ_Заказ.
// 1С-специфические реквизиты задаются отдельно.
//
// Параметры:
//   ДанныеЗП              - Структура  - данные из JSON (реквизиты уже десериализованы).
//   ЗП                    - ДокументОбъект.ЗаказПоставщику - заполняемый объект.
//   ЗаказыНаПеремещение   - Массив     - исходные данные ЗНП (для ДокументОснование).
//   СоответствиеУИДСсылка - Соответствие - УИДПотребности → ссылка на созданный ЗНП.
Процедура ШаблонЗаказы_ЗаполнитьЗаказПоставщику(ДанныеЗП, ЗП, ЗаказыНаПеремещение, СоответствиеУИДСсылка)

	ЗП.Дата             = ДанныеЗП["Дата"];
	ЗП.Склад            = ДанныеЗП["Склад"];
	//ЗП.Валюта           = ДанныеЗП["Валюта"];
	ЗП.СуммаДокумента   = ДанныеЗП["СуммаДокумента"];
	ЗП.IT_ВременнойСлот = ДанныеЗП["IT_ВременнойСлот"];
	
	// Поиск реквизитов
	Организация = НайтиОрганизациюПоИННИКПП(ДанныеЗП["ОрганизацияИНН"], ДанныеЗП["ОрганизацияКПП"]);
	
	Если Организация = Неопределено Тогда
		Описание = СтрШаблон("Не найдена Организация по (ИНН: %1, КПП: %2)", ДанныеЗП["ОрганизацияИНН"], ДанныеЗП["ОрганизацияКПП"]);
		ВызватьИсключение Описание;
	Иначе 
		ЗП.Организация = Организация;	
	КонецЕсли;
	
	Контрагент = НайтиКонтрагентаПоИННИКПП(ДанныеЗП["КонтрагентИНН"], ДанныеЗП["КонтрагентКПП"]);
	
	Если Контрагент = Неопределено Тогда
		Описание = СтрШаблон("Не найден Контрагент по (ИНН: %1, КПП: %2)", ДанныеЗП["КонтрагентИНН"], ДанныеЗП["КонтрагентКПП"]);
		ВызватьИсключение Описание;
	Иначе 
		ЗП.Контрагент = Контрагент;	
	КонецЕсли;
	
	Договор = НайтиДоговор(Контрагент, ДанныеЗП["ДоговорДата"], ДанныеЗП["ДоговорНомер"]);
	
	Если Договор = Неопределено Тогда
		Описание = СтрШаблон("Не найден Договор по (Дата: %1, Номер: %2)", ДанныеЗП["ДоговорДата"], ДанныеЗП["ДоговорНомер"]);
		ВызватьИсключение Описание;
	Иначе 
		ЗП.Договор = Договор;	
	КонецЕсли;
	
	// Реквизиты по-умолчанию
	ДатаПлюс7Дней 			= ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ДанныеЗП["Дата"], 7, Перечисления.ЕдиницыИзмеренияВремени.День);
	ПользовательОбмена 		= Пользователи.ТекущийПользователь(); 
		
	Если ЗначениеЗаполнено(ДанныеЗП["Менеджер"]) Тогда
		ЗП.Менеджер = ДанныеЗП["Менеджер"];
	Иначе
		ЗП.Менеджер = ПользовательОбмена;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗП["ЦенаВключаетНДС"]) Тогда
		ЗП.ЦенаВключаетНДС = ДанныеЗП["ЦенаВключаетНДС"];
	Иначе
		ЗП.ЦенаВключаетНДС = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗП["ЖелаемаяДатаПоступления"]) Тогда
		ЗП.ЖелаемаяДатаПоступления = ДанныеЗП["ЖелаемаяДатаПоступления"];
	Иначе
		ЗП.ЖелаемаяДатаПоступления = ДатаПлюс7Дней;
	КонецЕсли;

	ЗП.ДатаСогласования = ДанныеЗП["Дата"];
	
	Если ЗначениеЗаполнено(ДанныеЗП["Комментарий"]) Тогда
		ЗП.Комментарий = ДанныеЗП["Комментарий"];
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗП["Автор"]) Тогда
		ЗП.Автор = ДанныеЗП["Автор"];
	Иначе
		ЗП.Автор = ПользовательОбмена;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗП["ПЛ_Заметки"]) Тогда
		ЗП.ПЛ_Заметки = ДанныеЗП["ПЛ_Заметки"];
	КонецЕсли;

	// ДокументОснование заполняется только при единственном ЗаказеНаПеремещение
	Если ЗаказыНаПеремещение.Количество() = 1 Тогда
		ЗП.ДокументОснование = СоответствиеУИДСсылка[ЗаказыНаПеремещение[0]["УИДПотребности"]];
	КонецЕсли;
	
	// приходит строка, нужно найти элемент справочника
	ЗП.Валюта = Справочники.Валюты.НайтиПоНаименованию(ДанныеЗП["Валюта"],Истина);
	
	// Реквизиты не из запроса, обязательные к заполнению, но по-умолчанию
	ЗП.ВариантПриемкиТоваров 				= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ЗП.ЗакупкаПодДеятельность 				= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ЗП.Партнер								= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"Партнер");
	ЗП.НалогообложениеНДС 					= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ЗП.ПЛ_ПодтвержденоCostControl			= Истина;
	ЗП.ПорядокРасчетов						= Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	ЗП.Приоритет                            = Справочники.Приоритеты.ПолучитьНизшийПриоритет();
	ЗП.Согласован                           = Истина;
	ЗП.СпособДоставки                       = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
	ЗП.Статус                               = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;
	ЗП.ХозяйственнаяОперация                = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ЗП.ЦенаВключаетНДС                      = Истина;
	
	Для Каждого СтрокаТоваров Из ДанныеЗП["Товары"] Цикл

		НоваяСтрока              		= ЗП.Товары.Добавить();
		НоваяСтрока.Номенклатура 		= СтрокаТоваров["Номенклатура"];
		НоваяСтрока.Количество   		= СтрокаТоваров["Количество"];
		НоваяСтрока.КоличествоУпаковок  = СтрокаТоваров["Количество"];
		НоваяСтрока.Цена         		= СтрокаТоваров["Цена"];
		// Связь строки ЗП с конкретным ЗаказомНаПеремещение по ИдентификаторСтроки = УИДПотребности
		НоваяСтрока.ПЛ_Заказ    		= СоответствиеУИДСсылка[СтрокаТоваров["ИдентификаторСтроки"]];

		Если ЗначениеЗаполнено(СтрокаТоваров["ПЛ_Комментарий"]) Тогда
			НоваяСтрока.ПЛ_Комментарий 	= СтрокаТоваров["ПЛ_Комментарий"];
		КонецЕсли;
		
		ОбработатьСтрокуПриДобавленииЗП(ЗП,НоваяСтрока);
		
	КонецЦикла;
	
	ЗаполнитьПустыеДатыПоступленияСервер(ЗП);
	
КонецПроцедуры

Процедура ОбработатьСтрокуПриДобавленииЗП(Объект,ТекущаяСтрока)
	
	Перем КэшированныеЗначения;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
			
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
КонецПроцедуры

// Заполняет необходимые даты в объекте для проведения регистров накопления, 
// вызывается интерактивно на форме
Процедура ЗаполнитьПустыеДатыПоступленияСервер(Объект);
		
	Если НЕ Объект.ПоступлениеОднойДатой Тогда
		Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) 
			И Объект.ЖелаемаяДатаПоступления - Объект.ДлительностьДоставки * 86400 >= Объект.Дата Тогда
			ДатаОтгрузки = Объект.ЖелаемаяДатаПоступления - Объект.ДлительностьДоставки * 86400;
		Иначе
			ДатаОтгрузки = ТекущаяДатаСеанса();
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.ДатаПоступления) Тогда
			Если ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
				Объект.ДатаПоступления =Объект.ДатаОтгрузки + Объект.ДлительностьДоставки * 86400;
			ИначеЕсли ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) И Объект.ЖелаемаяДатаПоступления - Объект.ДлительностьДоставки * 86400 >= Объект.Дата Тогда
				Объект.ДатаПоступления = Объект.ЖелаемаяДатаПоступления;
				Объект.ДатаОтгрузки = Объект.ДатаПоступления - Объект.ДлительностьДоставки * 86400;
			Иначе
				Объект.ДатаОтгрузки = ТекущаяДатаСеанса();
				Объект.ДатаПоступления = Объект.ДатаОтгрузки + Объект.ДлительностьДоставки * 86400;
			КонецЕсли;
		КонецЕсли;
		
		ДатаОтгрузки = Объект.ДатаОтгрузки;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) Тогда
			СтрокаТЧ.ДатаОтгрузки = ДатаОтгрузки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаПоступления) Тогда
			СтрокаТЧ.ДатаПоступления = ДатаОтгрузки + Объект.ДлительностьДоставки * 86400;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет существование переданных ссылок в базе данных.
// Группирует ссылки по типу метаданных и выполняет один запрос на каждую таблицу.
//
// Параметры:
//   СсылкиДляПроверки - Массив структур {Ссылка: ЛюбаяСсылка, ОписаниеПоля: Строка}
//
// Возвращаемое значение:
//   Массив - строки с описанием ненайденных объектов (пустой, если все найдены)
Функция ШаблонЗаказы_ПроверитьСуществованиеСсылок(СсылкиДляПроверки)

	ГруппыПоТаблице = Новый Соответствие;

	Для Каждого Элемент Из СсылкиДляПроверки Цикл

		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Ссылка));

		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ИмяТаблицы = МетаданныеОбъекта.ПолноеИмя();
		Группа     = ГруппыПоТаблице.Получить(ИмяТаблицы);

		Если Группа = Неопределено Тогда
			Группа = Новый Массив;
			ГруппыПоТаблице.Вставить(ИмяТаблицы, Группа);
		КонецЕсли;

		Группа.Добавить(Элемент);

	КонецЦикла;

	ОшибкиСуществования = Новый Массив;

	// Один запрос на каждый тип метаданных — группировка выполнена выше.
	// Подавляем CreateQueryInCycle: цикл идёт по типам, а не по записям.
	//BSLLS:CreateQueryInCycle-off
	Для Каждого КлючЗначение Из ГруппыПоТаблице Цикл

		ИмяТаблицы = КлючЗначение.Ключ;
		Группа      = КлючЗначение.Значение;

		СписокСсылок = Новый Массив;

		Для Каждого Элемент Из Группа Цикл
			СписокСсылок.Добавить(Элемент.Ссылка);
		КонецЦикла;

		Запрос = Новый Запрос;
		//BSLLS:RefOveruse-off
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Ссылка КАК Ссылка
		|ИЗ
		|	" + ИмяТаблицы + " КАК т
		|ГДЕ
		|	т.Ссылка В (&СписокСсылок)";
		//BSLLS:RefOveruse-on
		Запрос.УстановитьПараметр("СписокСсылок", СписокСсылок);

		РезультатЗапроса = Запрос.Выполнить();

		НайденныеСсылки = Новый Соответствие;
		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл
			НайденныеСсылки.Вставить(Выборка.Ссылка, Истина);
		КонецЦикла;

		Для Каждого Элемент Из Группа Цикл

			Если НайденныеСсылки.Получить(Элемент.Ссылка) = Неопределено Тогда
				ОшибкиСуществования.Добавить(СтрШаблон(
					НСтр("ru='Объект не найден в базе данных: %1'"),
					Элемент.ОписаниеПоля));
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;
	//BSLLS:CreateQueryInCycle-on

	Возврат ОшибкиСуществования;

КонецФункции

#КонецОбласти // ШаблоныИнтеграции
